def start():
    底盘灯(常量.装甲所有, 白色, 常量.常亮)
    时间.睡眠(1)
    底盘灯(常量.装甲所有, 黑色, 常量.熄灭)
    时间.睡眠(1)
    底盘灯(常量.装甲前底, 黄色, 常量.呼吸)
    底盘灯(常量.装甲左底, 红色, 常量.闪烁)
    底盘灯(常量.装甲后底, 绿色, 常量.呼吸)
    底盘灯(常量.装甲右底, 蓝色, 常量.闪烁)

def 底盘灯(位置, 颜色, 灯效):
    LED灯.底盘(位置, 颜色['红'], 颜色['绿'], 颜色['蓝'], 灯效)

白色 = {'红': 255, '绿': 255, '蓝': 255}
黑色 = {'红': 0, '绿': 0, '蓝': 0}
黄色 = {'红': 255, '绿': 255, '蓝': 0}
红色 = {'红': 255, '绿': 0, '蓝': 0}
绿色 = {'红': 0, '绿': 255, '蓝': 0}
蓝色 = {'红': 0, '绿': 0, '蓝': 255}

# 以下为API中文化部分, 与程序逻辑无关. 请勿作修改.

LED灯 = led_ctrl
LED灯.底盘 = LED灯.set_bottom_led

# 常量部分
常量 = rm_define
常量.装甲所有 = 常量.armor_all
常量.装甲前底 = 常量.armor_bottom_front
常量.装甲后底 = 常量.armor_bottom_back
常量.装甲左底 = 常量.armor_bottom_left
常量.装甲右底 = 常量.armor_bottom_right

常量.常亮 = 常量.effect_always_on
常量.熄灭 = 常量.effect_always_off
常量.呼吸 = 常量.effect_breath
常量.闪烁 = 常量.effect_flash

时间 = time
时间.睡眠 = 时间.sleep